##Задание 1
##s = str(input("Введите слово: "))
##for symbol in s:
##    if int(symbol) % 2 == 0:
##        continue
##    if symbol == "а" or symbol == "к":
##        break
##    print(symbol)


##Задание 2
##s = str(input("Введите слово: "))
##a = s[::-1]
##print(a)
##for symbol in a:
##    if symbol != "з" and symbol != "я":
##        break
##        print(a)



##Задание 3
##a = int(input("Введите число: "))
##s = str
##for s in range(a):
##    s = input("Введите слово: ")
##
##    if s == "программирование":
##        break
